JaidenK/HydroponicsAutomation/Designs/Software/Embedded/PSoC/HydroponicAutomationSensorPerf.cydsn/Generated_Source/PSoC5/PingSensorTrigControl.h
/*******************************************************************************
* File Name: PingSensorTrigControl.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_PingSensorTrigControl_H) /* CY_CONTROL_REG_PingSensorTrigControl_H */
#define CY_CONTROL_REG_PingSensorTrigControl_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} PingSensorTrigControl_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    PingSensorTrigControl_Write(uint8 control) ;
uint8   PingSensorTrigControl_Read(void) ;

void PingSensorTrigControl_SaveConfig(void) ;
void PingSensorTrigControl_RestoreConfig(void) ;
void PingSensorTrigControl_Sleep(void) ; 
void PingSensorTrigControl_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define PingSensorTrigControl_Control        (* (reg8 *) PingSensorTrigControl_Sync_ctrl_reg__CONTROL_REG )
#define PingSensorTrigControl_Control_PTR    (  (reg8 *) PingSensorTrigControl_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_PingSensorTrigControl_H */


/* [] END OF FILE */
